
% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID，风电机识别码 在 mpc.mode_id 中的索引
% 4.PPER，有功发电比例（0~1）
% 5.QPER，无功发电比例（0~1）
% 6.MVA，单个光伏阵列的额定容量（MVA）
% 7.T，实际温度（°C；缺省25）
% 8.Uoc，单体电池标准条件下的开路电压（V）
% 9.Isc，单体电池标准条件下的短路电流（A）
% 10.Upmax，最大功率点的电压（V）
% 11.Ipmax，最大功率点的电流（A）
% 12.ISHT，光伏阵列的并联电池组数
% 13.ISER，光伏阵列每组光伏电池组的串联单体光伏电池数
% 14.C，直流侧电容大小（mF）
% 15.NM，组数

MS = [ 
1	48	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	300
2	49	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	300
3	50	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	300
4	51	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	300
5	52	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	300
];



% NAME；风电机组名称
% BASE；风电机组额定电压（kV）
% ID；识别码 在 mpc.mode_id 中的索引
% T1；测量时间常数（秒）
% KPUDC；直流电压PI控制比例系数
% KIUDC；直流电压PI控制积分系数
% MAXID；PI控制环节最大限幅（共用）
% MINID；PI控制环节最小限幅（共用）
% TPC；时间常数（s）
% PMAX；功率最大限制（pu；相对额定功率的标么值）
% PMIN；功率最小限制（pu；相对额定功率的标么值）
% dP/dtMAX；功率最大变化率（pu/s；相对额定功率的标么值）
% dP/dtMIN；功率最小变化率（pu/s；相对额定功率的标么值）
% PCON_TYP；功率控制方式；=0；定直流电压控制（详细计算使用）；=1；恒功率控制（简化计算使用）
% KPP；恒功率PI控制环节系数
% KIP；恒功率PI控制环节时间常数（秒）

EU = [ 
1	75	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
2	76	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
3	48	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
4	49	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
5	50	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
6	51	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
7	52	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；风电机识别码 在 mpc.mode_id 中的索引
% 4.RC；电压补偿电阻标么值
% 5.XC；电压补偿电抗标么值
% 6.TR；电压测量时间常数(s)
% 7.KPV；比例环节系数
% 8.KPI；积分环节系数
% 9.QMAX；无功最大限制(pu)
% 10.QMIN；无功最小限制(pu)
% 11.TV；时间常数(s)
% 12.TPV；时间常数(s)
% 13.IPF；=0；电压控制方式；=1采用恒功率因数控制方式
% 14.TPE；时间常数(s)
% 15.NAME 控制节点名称 + BASE 控制节点基准电压（kV）在 mpc.bus_name 中的索引

EZ = [ 
1	73	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
2	74	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
3	75	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
4	76	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
5	48	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
6	49	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
7	50	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
8	51	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
9	52	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.IMAX；最大电流限制（pu；本机额定容量为基准）
% 5.Idmax；有功电流最大限制（pu；本机额定容量为基准）
% 6.Iqmax；无功电流最大限制（pu；本机额定容量为基准）
% 7.IPQ_LOW；低电压期间无功控制优先标志（=0；无功优先；=1；有功优先）
% 8.IPQ_HIGH；高电压期间无功控制优先标志（=0；有功优先；=1；无功优先）
% 9.IMAX_FLG；低电压穿越期间总电流限制方式（=0；不变；=1；按照初值的比例设定）
% 10.IMAX_PER；低穿期间最大电流限制与初始电流的比例
% 11.KQP；无功控制比例系数（pu；本机额定容量为基准）
% 12.KQI；无功控制积分系数（pu；本机额定容量为基准）
% 13.dQmax；无功控制环节限幅最大值（pu；本机额定容量为基准）
% 14.dQmin；无功控制环节限幅最小值（pu；本机额定容量为基准）
% 15.Tdelay；电流注入时间延时（s）

ES = [ 
1	73	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
2	74	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
3	75	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
4	76	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
5	48	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
6	49	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
7	50	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
8	51	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
9	52	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.VOL_TYP；判断故障穿越的电压类型（=0；正序电压；=1；最小或最大相电压）
% 5.VOL_LOW；判断进入低电压穿越状态的电压值（pu）
% 6.VOL_LOW_RET；判断退出低电压穿越状态的电压值（pu）
% 7.VOL_LOW_DELAY；低电压判断时间（周波）
% 8.VOL_HIGH；判断进入高电压穿越状态的电压值（pu）
% 9.VOL_HIGH_RET；判断退出高电压穿越状态的电压值（pu）
% 10.VOL_HIGH_DELAY；高电压判断时间（周波）

EV = [ 
1	73	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
2	74	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
3	75	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
4	76	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
5	48	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
6	49	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
7	50	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
8	51	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
9	52	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.参数组标志；含义见说明书（共8种：L、H、S、T、M、N、U、V）在 mpc.other_string 中的索引
% 5.参数组填法标志；B表示BPA填法；P表示PSASP填法 在 mpc.other_string 中的索引
% 6.IRT_CON；电压恢复过程中是否再次进入故障穿越过程的标志；=0进入；=1不进入
% 7.IP_FLG；故障穿越期间的有功控制方式（=0指定电流；=1指定电流百分比；=2指定功率；=3指定功率百分比）
% 8.IP_SET1；故障穿越期间的有功电流或功率控制值
% 9.TDELAY；故障穿越期间进入功率保持的延时（周波）
% 10.IP_FLG2；穿越后设定有功爬坡初始值的方式（=0指定电流；=1指定电流百分比；=2指定功率；=3指定功率百分比）
% 11.IP_SET2；穿越后设定有功爬坡的初始值
% 12.IP_TIM2；穿越后维持设定的初始电流或功率的时间（周波）
% 13.IP_RATE_FLG；穿越后有功爬坡过程的方式（=0；立即恢复=1；按照指定斜率上升；填写42-56列=2；按照抛物线的方式上升；填写57-61列=3；按照指定时间斜线上升；填写57-61列）
% 14.IP_RATE；穿越后爬坡过程中；有功电流或功率上升速率（A/s或MW/s）（= -1.0；立即恢复到故障发生前的数值
% 15.IP_RATE2；穿越后爬坡过程中；有功电流或功率上升的慢速速率（A/s或MW/s）
% 16.P_RATE_CHANGE；爬坡过程中上升速率由41-45列速率转换为46-50列速率的功率或者电流值相对初值的比例
% 17.TP；恢复时间常数（s；对应从0恢复到额定功率的时间）
% 18.IPI_COM；不对称故障期间有功电流的控制方式（0和三相故障一致；1根据正序电压计算有功电流限制）
% 19.PILIM_K1；正序电流限幅计算系数1
% 20.PILIM_K2；正序电流限幅计算系数2
% 21.IP_RATE_FLG2；不对称故障后有功爬坡方式（0和三相故障一致；1根据正序电压计算有功电流限制）

LP = [ 
1	73	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
2	74	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
3	75	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
4	76	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
5	48	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
6	49	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
7	50	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
8	51	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
9	52	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.参数组标志；含义见说明书（共8种：L、H、S、T、M、N、U、V） 在 mpc.other_string 中的索引
% 5.参数组填法标志；B表示BPA填法；P表示PSASP填法  在 mpc.other_string 中的索引
% 6.ICON_TYP；三相对称条件下的无功控制方式=0；采用电压控制无功电流的方式；=2；指定无功功率值；=3；指定无功电流值。
% 7.VOLTYP；选择的最小电压类型；=0正序电压；=1相电压
% 8.VOL_REF；计算无功电流的电压参考值（pu）；缺省0.9pu
% 9.Q_RATE；19列为0时；填写无功调整系数（pu）19列为2时；填写无功功率值（Mvar）19列为3时；填写无功电流值（A）
% 10.ICONTYP2；三相不对称条件下的无功控制方式：=0没有无功输出；=1指定固定值；=2采用和正序相同的控制方式；=3采用负序电压控制；=4采用正序和负序电压共同控制
% 11.KQ2；采用负序电压控制时；计算电流参考值的系数
% 12.IQMAX；不对称时；无功电流最大限制（A）；当31列为1时；无功电流指定值（A）
% 13.IQ_FLG；穿越后的无功控制方式：=0不控制；恢复初始状态；=1保持一定值一段时间；=2以指数形式下降；=3以斜线形式下降
% 14.IQ_START；穿越后无功下降的开始电流或者保持的电流（A）
% 15.IQ_TP；降低的时间常数或者保持的时间（s）
% 16.IQLIM；无功电流最大限制（A）

LQ = [ 
1	73	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
2	74	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
3	75	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
4	76	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
5	48	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
6	49	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
7	50	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
8	51	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
9	52	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.发电机ID 在 mpc.mode_id 中的索引
% 4.电压设定值1(pu)(不能为1/大于1为过电压/小于1为低电压)
% 5.设定值1延迟时间(周波)
% 6.电压设定值2(pu)
% 7.设定值2延迟时间(周波)
% 8.电压设定值3(pu)
% 9.设定值3延迟时间(周波)
% 10.电压设定值4(pu)
% 11.设定值4延迟时间(周波)
% 12.电压设定值5(pu)
% 13.设定值5延迟时间(周波)
% 14.继电器动作时间(周波)
% 15.控制节点名称(不为空时表示实际参与判断的母线) + 控制节点基准电压(kV) 在 mpc.bus_name 中的索引

% 16.电压设定值6(pu)(不能为1/大于1为过电压/小于1为低电压)
% 17.设定值6延迟时间(周波)
% 18.电压设定值7(pu)
% 19.设定值7延迟时间(周波)
% 20.电压设定值8(pu)
% 21.设定值8延迟时间(周波)
% 22.电压设定值9(pu)
% 23.设定值9延迟时间(周波)
% 24.电压设定值10(pu)
% 25.延迟时间10（周波）

RE_REplus = [ 
1	73	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
2	74	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
3	75	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
4	76	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
5	48	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
6	49	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
7	50	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
8	51	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
9	52	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；风电机识别码 在 mpc.mode_id 中的索引
% 4.PCON_TYP；功率控制方式（=0；转速控制；=1；恒转矩控制；=2；恒功率控制）
% 5.TPE；时间常数（s）
% 6.KPTRQ；转矩控制环节的比例环节系数
% 7.KITRQ；转矩控制环节的积分环节系数
% 8.TPC；时间常数（s）
% 9.PMAX；功率最大限制（pu；相对额定功率的标么值）
% 10.PMIN；功率最小限制（pu；相对额定功率的标么值）
% 11.dP/dtMAX；功率最大变化率（pu/s；相对额定功率的标么值）
% 12.dP/dtMIN；功率最小变化率（pu/s；相对额定功率的标么值）
EP = [ 
1	73	0     	2	60.000	3.0000	0.6000	0.0500	1.0000	0.0400	0.4500	-0.450
2	74	0     	2	60.000	3.0000	0.6000	0.0500	1.0000	0.0400	0.4500	-0.450
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；风电机识别码 在 mpc.mode_id 中的索引
% 4.Tr；转速测量时间常数（秒）
% 5.Kp；转速控制比例环节系数（p.u.）
% 6.KI；转速控制积分环节系数（p.u.）
% 7.Tpr；电磁功率测量时间常数（秒）
% 8.Kpp；电磁功率比例环节系数（p.u.）
% 9.Kpi；电磁功率积分环节系数（p.u.）
% 10.TP；伺服时间常数（秒）
% 11.DBETA_MAX；桨距角的最大变化速度（度/秒）
% 12.DBETA_MIN；桨距角的最小变化速度（度/秒）
% 13.BETA_MAX；桨距角最大限制（度）
% 14.BETA_MIN；桨距角最小限制（度）
% 15.INPTYP；控制量选择（=0；输入转速和电磁功率；=1；输入转速；=2；输入电磁功率）

GF = [ 
1	73	0     	0.0200	150.00	25.000	0.0200	3.0000	30.000	0.3000	10.000	-10.00	30.000	0.0000	1
2	74	0     	0.0200	150.00	25.000	0.0200	3.0000	30.000	0.3000	10.000	-10.00	30.000	0.0000	1
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；风电机识别码 在 mpc.mode_id 中的索引
% 4.V_cutin；切入风速（m/s）
% 5.V_cutout；切出风速（m/s）
% 6.V_init；初始风速（m/s）
% 7.ρ；空气密度（kg/m3）
% 8.R；叶片扫风半径（m）
% 9.ρAr/2
% 10.KB；计算页尖速率比的系数
% 11.ΩN；叶片额定机械角速度（rad/s）
% 12.ICP；风能转换效率系数CP的计算方法选择
% 13.B；叶片数（定浆矩系统）
% 14.L/D；升力比（定浆矩系统）或Cf；叶片设计常数（变浆矩系统）
% 15.AMIN；最小桨矩角（度）（变浆矩系统）
% 16.TH；轮毂时滞效应的时间常数

TG = [ 
1	73	0     	3.0000	20.000	0.0000	1.2250	44.550	0.00000	0.0000	0.0000	0	0 	0.0000	0.0000	0.0000
2	74	0     	3.0000	20.000	0.0000	1.2250	44.550	0.00000	0.0000	0.0000	0	0 	0.0000	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3. ID；风电机识别码 在 mpc.mode_id 中的索引
% 4. ITWO_MASS；=0；单质量块模型；否则采用双质量块模型
% 5. J_GEN；发电机转动惯量（kg.m2）
% 6. J_turbine；风轮及叶片转动惯量（kg.m2）
% 7. Ktg；刚性系数（106 Nm/rad）
% 8. Dtg；阻尼系数（106 Nm/rad）
% 9. p；发电机极对数
% 10.Ngear；齿轮箱变比（高速轴相对低速轴）
% 11.FLAG；变速抽蓄机组模型标志（=0或不填；风机；=8；双馈抽蓄；=9；全变流抽蓄）

ME = [ 
1	73	0     	0	58.0000	4857143.000	88.7000	0.25000	2.00	106.000	0
2	74	0     	0	58.0000	4857143.000	88.7000	0.25000	2.00	106.000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.PPER；有功比例（占潮流总出力的比例；缺省1.0）
% 5.QPER；无功比例（占潮流总出力的比例；缺省1.0）
% 6.MVABASE；额定容量（MVA）
% 7.Rs；定子电阻标么值（本机额定容量为基准）
% 8.Xs；定子电抗标么值（本机额定容量为基准）
% 9.Xm；激磁电抗标么值（本机额定容量为基准）
% 10.Rr；转子电阻标么值（本机额定容量为基准）
% 11.Xr；转子电抗标么值（本机额定容量为基准）
% 12.VC0；换流器直流侧电容初始电压（V）
% 13.C；换流器直流侧电容（F）
% 14.PN；额定功率（MW）
% 15.NG；机组台数
% 16.Td0p；时间常数（s）
% 17.FLAG；发电机处理方式标志（=0；简化电流源；=1；详细电机；=2；简化电压源；=8；双馈抽蓄；=9；全变流抽蓄）

MM = [ 
1	73	0     	1.00	1.00	1.600	0.0114	0.0752	3.9270	0.0104	0.1469	0.0000	1070.0	0.20000	1.500	200	0
2	74	0     	1.00	1.00	1.600	0.0114	0.0752	3.9270	0.0104	0.1469	0.0000	1070.0	0.20000	1.500	200	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.PPER；有功比例（占潮流总出力的比例；缺省1.0）
% 5.QPER；无功比例（占潮流总出力的比例；缺省1.0）
% 6.MVABASE；风电机组额定容量（MVA）
% 7.VC0；换流器直流侧电容初始电压（V）
% 8.C；换流器直流侧电容（F）
% 9.PN；额定功率（MW）
% 10.NG；风电机台数

MY = [ 
1	75	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	200
2	76	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	200
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 电机识别码
% 电机功率因数
% 类型: H－水轮机 S－汽轮机(此处为索引，值在 mpc.other_string)
% 所有者 (此处为索引，值在 mpc.other_string)
% Xd''直轴暂态电抗Xdpp(标么值)
% Xq''交轴暂态电抗Xqpp(标么值)
% Td0''直轴次暂态时间常数Td0pp(秒)
% Tq0''交轴次暂态时间常数Tq0pp(秒)
% X2负序电抗(p.u.)
% Xd-bh''直轴次暂态电抗的饱和值(p.u.)

% 发电机动能(MW*秒)
% 发电机初始有功功率占母线潮流功率百分数
% 发电机初始无功功率占母线潮流功率百分数
% 电机标么参数的基准容量
% 定子电阻(标么值)
% 直轴暂态电抗Xdp(标么值)
% 交轴暂态电抗Xqp(标么值)
% 直轴不饱和同步电抗Xd(标么值)
% 交轴不饱和同步电抗Xq(标么值)
% 直轴暂态开路时间常数Tdop(秒)
% 交轴暂态开路时间常数Tqop(秒)
% 定子漏抗(标么值)
% 额定电压时电机饱和系数
% 1.2倍额定电压时电机饱和系数
% 电机阻尼转距系数百分数

M_MF = [ 
1	66	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
2	67	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
3	68	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
4	69	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
5	70	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
6	71	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
7	72	0     	0.90	5     	0     	0.2180	0.2170	0.046	0.070	0.0000	0.0000	5000.00	0.00	0.00	667.0	0.000	0.2840	0.4284	1.9180	1.8670	7.880	0.87	0.1380	0.1100	0.310	0.00
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID 电机识别码 在 mpc.mode_id 中的索引
% 4.PSS信号接入点选择
% 5.RC 负载补偿之有功关分量（标么值）
% 6.XC 负载补偿之有功关分量（标么值）
% 7.TR 调节器输入滤波器时间常数（秒）
% 8.K 调节器增益（标么值）
% 9.KV 比例积分或纯积分调节选择因子
% 10.T1 电压调节器时间常数（秒）
% 11.T2 电压调节器时间常数（秒）
% 12.T3 电压调节器时间常数（秒）
% 13.T4 电压调节器时间常数（秒）
% 14.KA 调压器增益（标么值）
% 15.TA 调压器放大器的时间常数（秒）
% 16.KF 调压器稳定回路增益（标么值）
% 17.TF 调压器稳定回路时间常数（秒）
% 18.KH 励磁机电流反馈增益（标么值）

% 19.VAMAX 调节器最大内部电压(标值)
% 20.VAMIN 调节器最小内部电压(标值)
% 21.KB 第二级调节器增益
% 22.T5 第二级调节器时间常数
% 23.KE 励磁机自励磁系数（标么值）
% 24.TE 励磁机时间常数（秒）
% 25.SE1 最大励磁电压处的励磁机饱和系数
% 26.SE2 75％最大励磁电压处的励磁机饱和系数
% 27.VRMAX 电压调节器最大输出（标么值）
% 28.VRMIN 电压调节器最小输出（标么值）
% 29.KC 换相电抗的整流器负载因子
% 30.KD 去磁因子（标么值）
% 31.KL1 励磁机励磁电流限制增益（标么值）
% 32.VL1R 励磁机电流限制（标么值）
% 33.EFDMAX 最大励磁电压（标么值）

FV_Fplus = [ 
1	66	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
2	67	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
3	68	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
4	69	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
5	70	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
6	71	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
7	72	0     	0	0.000	0.000	0.0100	500.00	1.00	1.0000	8.3300	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.880    -5.70    0.101    0.000    0.000    0.000    0.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.识别码ID 在 mpc.mode_id 中的索引，当一母线上有多台机时用ID来识别
% 4.TRW
% 5.T5
% 6.T6
% 7.T7
% 8.KR
% 9.TRP
% 10.TW
% 11.TW1
% 12.TW2
% 13.KS
% 14.T9
% 15.T10
% 16.T12
% 17.输入0或者空格输入信号为w和PG；1输入信号只有；2输入信号只有PG

% 18.KP
% 19.T1
% 20.T2
% 21.T13
% 22.T14
% 23.T3
% 24.T4
% 25.VSMAX
% 26.VSMIN
% 27.零或空格输入信号发电机速度偏差1母线频率偏差
% 28.输入母线频率信号对应的母线名称 + BUS_BSE (在 mpc.bus_name 中的索引)
% 29.SI卡中的KR的基准容量(MVA)

SI_SIplus = [ 
1	66	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
2	67	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
3	68	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
4	69	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
5	70	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
6	71	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
7	72	0     	0.020	5.0000	5.0000	5.0000	1.00000	0.020	0.4400	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	1.0000	0.2100	0.0300	0.0000	0.0000	0.3000	0.0300	0.10000	-0.1000	0	0	700.0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.发电机识别码 在 mpc.mode_id 中的索引
% 4.Pe原动机额定输出功率（MW）
% 5.Tc油动机关闭时间常数
% 6.To油动机开启时间常数
% 7.VELclose过速关闭系数(pu)
% 8.VELopen过速开启系数(pu)
% 9.PMAX最大原动机输出功率（油动机最大行程或调门最大开度）(pu)
% 10.PMIN最小原动机输出功率（油动机最小行程或调门最小开度）(pu)
% 11.T1油动机行程反馈环节（LVDT）时间
% 12.KP比例放大倍数
% 13.KD (Td)微分倍数
% 14.KI (1/Ti)积分倍数
% 15.INTG_MAX积分上限
% 16.INTG_MIN积分下限
% 17.PID_MAX输出上限
% 18.PID_MIN输出下限

% 19.PGV_DELAY 功率输出信号的纯延迟时间（秒）

GA_GAplus = [ 
1	66	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.400	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
2	67	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.400	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
3	68	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.100	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
4	69	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.100	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
5	70	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.100	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
6	71	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.400	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
7	72	0     	630.000	1.130	1.150	-1.00	1.000	1.060	0.400	0.020	7.000	0.000	0.000	10.00	-10.0	0.100	-0.10	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.发电机识别码 （在 mpc.mode_id 中的索引）
% 4.转速测量环节时间常数T1（秒）一般取0.01秒、0.02秒或0.05秒
% 5.转速偏差死区ε（相对系统频率的标么值死区为±0.5ε）
% 6.转速偏差放大倍数K1一般取22.2考虑到部分机组没有投入负荷反馈计算中可取18~20
% 7.控制方式选择（各种方式下一次调频均能自动投入）1 - 调节级压力反馈控制；2 -  DEH开环控制;3 - 负荷反馈控制;此值必须填写无缺省值
% 8.PID比例环节倍数KP
% 9.PID微分环节倍数KD
% 10.PID积分环节倍数KI
% 11.PID积分环节限幅上限INTG_MAX
% 12.PID积分环节限幅下限INTG_MIN
% 13.PID输出限幅环节的上限PID_MAX
% 14.PID输出限幅环节的下限PID_MIN
% 15.K2 负荷控制前馈系数取值0 ~ 1
% 16.一次调频负荷上限:0.05~0.1
% 17.一次调频负荷下限:-1

% 18.频率输入信号的纯延时时间（秒）
% 19.功率反馈信号的纯延时时间（秒）
% 20.功率反馈信号对应的一阶惯性环节时间常数（秒）
% 21.频率信号放大后的纯延时时间（秒）
% 22.频率信号放大后输入PID的纯延时时间（秒）
% 23.频率信号放大后输入PID信号的上升速率限制（pu/秒）
% 24.频率信号放大后输入PID信号的下降速率限制（pu/秒）

GJ_GJplus = [ 
1	66	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
2	67	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
3	68	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
4	69	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
5	70	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
6	71	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
7	72	0     	0.0200	0.00130	10.000	3	0.1000	0.0000	0.0300	10.00	-10.0	10.00	-10.0	1.0000	0.0037	-0.004	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID电机识别码 在 mpc.mode_id 中的索引
% 4.TCH蒸汽容积时间常数(秒)
% 5.FHP高压缸功率比例
% 6.TRH再热器时间常数
% 7.FIP中压缸功率比例
% 8.TCO交叉管时间常数
% 9.FLP低压缸功率比例
% 10.高压缸功率自然过调系数

TB = [ 
1	66	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
2	67	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
3	68	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
4	69	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
5	70	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
6	71	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
7	72	0     	0.2000	0.3000	10.000	0.4000	0.4000	0.3000	0.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.G_max最大触发角控制增益
% 4.T_amax最大触发角控制时间常数
% 5.Gammaref熄弧角参考值
% 6.Gammamin最小熄弧角
% 7.Kp_vca定电压控制比例增益
% 8.Ti_vca定电压控制积分时间常数
% 9.整流侧最小触发角控制增益1
% 10.整流侧最小触发角控制增益2
% 11.整流侧最小触发角控制电压阈值1
% 12.Dl整流侧最小触发角控制电压阈值2
% 13.最小触发角控制角度下降速率
% 14.T_ga逆变侧Gamma0启动延时时间
% 15.Alpha_retard直流移相触发角
% 16.Th_retard直流移相时间
% 17.Th_restart直流重启动延时时间
% 18.DISA非空则消去该直流控制系统 在 mpc.other_string 中的索引
% 19.DBG调试文件标志 在 mpc.other_string 中的索引
  
% 20.MOD；控制方式；1=恒定功率控制；0=恒定电流控制
% 21.LEAD；主控站；1=主控站；0=受控站
% 22.GAMM0；GAMM0标志；1=投入状态；0=退出状态
% 23.BC_ON；协调控制标志；1=双极协调；0=独立运行
% 24.Udlow；VDCOL启动电压
% 25.Udhigh；VDCOL退出电压
% 26.Udtup；VDCOL电压上升滤波时间常数
% 27.Udtdn；VDCOL电压下降滤波时间常数
% 28.Iomin_vdcl；VDCOL最小插值电流指令
% 29.Iomin；VDCOL最小电流指令
% 30.Id_t；定电流控制电流滤波时间常数
% 31.Gain；定电流控制总增益
% 32.Kp；定电流控制比例增益
% 33.Ti；定电流控制积分时间常数
% 34.G_cf；换相失败预测增益
% 35.K_cf；换相失败预测启动电压阈值
% 36.T_dn_cf；换相失败预测输出角度下降时间常数
% 37.Vno；逆变侧平衡站的优先级

% 38.Ud_ref_min；低压限流门槛最小修正系数(pu)
% 39.Uhgrepu；低压限流输入电压再标幺：南瑞=0；许继=1
% 40.Udhigh_r；VDCOL修正系数：南瑞=1.0；许继=2.0

% 41.Alpha_res直流重启动触发角
% 42.PEN，逆变侧控功率/电流有效，=1为有效，=0或不填为无效
% 43.UEN,换相失败电压判据有效，=1为有效，=0或不填为无效
% 44.换相失败电压临界值(pu)
% 45.Gama_CF，换相失败最小Gama角（°）
% 46.Udepr，降压重启动的电压设定值(p.u.)
% 47.Ksov，短期过负荷倍数
% 48.Tsov，短期过负荷时间(秒)
% 49.Klov，长期过负荷倍数
% 50.Tlov，长期过负荷时间(秒)
% 51.Tflock_Rec，单层闭锁信号传递到整流侧的时间
% 52.NameBC 双极协调工况下的对极节点名称 + BaseKvBC 双极协调工况下的对极节点基准电压 (在 mpc.bus_name 中的序号)
% 53.Ucrm，逆变侧控功率（电流）换流器电压裕度设定值（p.u.）
% 54.Icrm，逆变侧控功率（电流）换流器电流裕度设定值（p.u.）

DA_DZ_DAplus_DAsharp = [ 
1	44	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	164.0	0.150	0.034	0     	0     	1 	1 	1 	1 	0.300	0.800	0.060	0.002	0.500	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.7000	1.2000	3.0000	1.0500	7200.0	0.0300	46    	0.0000	0.0000
2	45	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	80.00	0.150	0.034	0     	0     	1 	0 	1 	1 	0.300	0.800	0.060	0.002	0.300	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.0000	1.2000	3.0000	1.0500	7200.0	0.0300	47    	0.0000	0.0000
3	46	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	164.0	0.150	0.034	0     	0     	1 	1 	1 	1 	0.300	0.800	0.060	0.002	0.500	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.7000	1.2000	3.0000	1.0500	7200.0	0.0300	44    	0.0000	0.0000
4	47	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	80.00	0.150	0.034	0     	0     	1 	0 	1 	1 	0.300	0.800	0.060	0.002	0.300	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.0000	1.2000	3.0000	1.0500	7200.0	0.0300	45    	0.0000	0.0000
];



% 1.变压器A侧母线名 + 变压器A侧母线电压基准值 在 mpc.bus_name 中的序号
% 2.变压器B侧母线名 + 变压器B侧母线电压基准值 在 mpc.bus_name 中的序号
% 3.SID变压器零序电抗的接入方式
% 4.PAR变压器线路平行码 在 mpc.other_string 中的索引
% 5.X0变压器零序电抗标么值
% 6.R0；变压器零序电阻（pu）

XO = [ 
1	66	3	2	0	0.002264	0.000000
2	67	4	2	0	0.002100	0.000000
3	68	6	2	0	0.001740	0.000000
4	69	9	2	0	0.002264	0.000000
5	70	9	2	0	0.002264	0.000000
6	71	10	2	0	0.002264	0.000000
7	72	11	2	0	0.002264	0.000000
8	53	1	3	1	0.021430	0.000000
9	53	12	3	1	-0.00210	0.000000
10	53	26	1	1	0.040930	0.000000
11	54	2	3	1	0.021430	0.000000
12	54	13	3	1	-0.00210	0.000000
13	54	27	1	1	0.040930	0.000000
14	55	3	3	1	0.001570	0.000000
15	55	14	3	1	-0.00158	0.000000
16	55	30	1	1	0.026680	0.000000
17	56	4	3	1	0.001570	0.000000
18	56	16	3	1	-0.00158	0.000000
19	56	33	1	1	0.026680	0.000000
20	57	5	3	1	0.001570	0.000000
21	57	18	3	1	-0.00158	0.000000
22	57	37	1	1	0.026680	0.000000
23	58	6	3	1	0.001570	0.000000
24	58	21	3	1	-0.00158	0.000000
25	58	40	1	1	0.026680	0.000000
26	59	9	3	1	0.021430	0.000000
27	59	23	3	1	-0.00210	0.000000
28	59	41	1	1	0.040930	0.000000
29	60	9	3	1	0.021430	0.000000
30	60	23	3	1	-0.00210	0.000000
31	60	41	1	1	0.040930	0.000000
32	61	9	3	1	0.021430	0.000000
33	61	23	3	1	-0.00210	0.000000
34	61	41	1	1	0.040930	0.000000
35	62	9	3	1	0.021430	0.000000
36	62	23	3	1	-0.00210	0.000000
37	62	41	1	1	0.040930	0.000000
38	63	10	3	1	0.021430	0.000000
39	63	24	3	1	-0.00210	0.000000
40	63	42	1	1	0.040930	0.000000
41	64	10	3	1	0.021430	0.000000
42	64	24	3	1	-0.00210	0.000000
43	64	42	1	1	0.040930	0.000000
44	65	11	3	1	0.021430	0.000000
45	65	25	3	1	-0.00210	0.000000
46	65	43	1	1	0.040930	0.000000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.R0对地支路零序电阻标么值
% 4.X0对地支路零序电抗标么值

XR = [ 
1	1		0.000000	0.048703
2	2		0.000000	0.073059
3	3		0.000000	-0.17749
4	4		0.000000	-0.17749
5	5		0.000000	0.060972
6	6		0.000000	0.073167
7	7		0.000000	-0.06520
8	8		0.000000	-0.00980
9	9		0.000000	0.048703
10	10		0.000000	0.048703
11	11		0.000000	0.048703
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID；识别码 在 mpc.mode_id 中的索引
% 4.ITYP；保护类型代码（=0；同时存在CROWBAR和CHOPPER；=1；只有CROWBAR相关参数有效；=2；只有CHOPPER相关参数有效）
% 5.ICROWBAR_type；CROWBAR保护类型（=0；主动型；=1；被动型）
% 6.ICROWBAR_CON_TYP；CROWBAR保护动作条件类型（=0；转子电流和直流电压；=1；转子电流；=2；直流电压）
% 7.R；CROWBAR对应的电阻（pu；本机额定容量为基准）
% 8.IROT_LIM；CROWBAR动作的转子电流限制（pu）
% 9.IROT_RET；CROWBAR动作后退出的转子电流值（pu）
% 10.IROT_DELAY；CROWBAR动作后返回的延迟时间（周波）CROWBAR返回判断转子电流的判断时间（周波）
% 11.VDC_LIM；CROWBAR动作的直流电压值（V）
% 12.VDC_RET；CROWBAR返回的直流电压值（V）
% 13.VDC_DELAY；CROWBAR返回判断直流电压的延迟时间（周波）
% 14.R；CHOPPER电阻（欧姆）
% 15.ICHOPPER_FLG；CHOPPER动作方式（=0；超过62-65列电压；全部投入；小于66-69列电压；退出；=1；超过62-65列电压；开始部分投入；达到66-69列电压；全部投入）
% 16.VDC_0；CHOPPER动作的直流电压1（V）
% 17.VDC_1；CHOPPER动作的直流电压2（V）

MR = [ 
1	75	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
2	76	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
];



% 1.前侧节点名称 + 前侧节点基准电压 在 mpc.bus_name 中的序号
% 2.后侧节点名称 + 后侧节点基准电压 在 mpc.bus_name 中的序号
% 3.回路号 在 mpc.mode_id 中的索引
% 4.故障类型代码(必须为1)
% 5.故障侧编号(1:前侧2：后侧)
% 6.故障发生时间(周波)
% 7.从故障发生到故障相前侧断开时间间隔周波数
% 8.从故障发生到故障相后侧断开时间间隔周波数
% 9.故障点距离前侧节点百分比
% 10.接地电阻(标幺值)
% 11.接地电抗(标幺值)

FLT = [ 
1	1	112     	1 	2	50.00	5.000	5.000	0.0	0.0000	0.0000
];



% 1.busname A 在 mpc.bus_name 中的序号
% 2.busname B 在 mpc.bus_name 中的序号
% 3.PAR平行码  在 mpc.other_string 中的索引
% 4.R0线路零序电阻(标么值)
% 5.X0线路零序电抗(标么值)
% 6.Ga0线路BUS A 侧零序对地电导
% 7.Bb0线路BUS A 侧零序对地电纳
% 8.Gb0线路BUS B 侧零序对地电导
% 9.Bb0线路BUS B 侧零序对地电纳

LO = [ 
1	1	2	1	0.001276	0.017779	0.000000	39.04080	0.000000	39.04080
2	1	2	2	0.001276	0.017779	0.000000	39.04080	0.000000	39.04080
3	7	2	1	0.000104	0.000617	0.000000	1.007900	0.000000	1.007900
4	7	2	2	0.000091	0.000582	0.000000	1.010500	0.000000	1.010500
5	7	2	3	0.000085	0.000562	0.000000	1.009200	0.000000	1.009200
6	5	7	1	0.001494	0.006027	0.000000	7.311300	0.000000	7.311300
7	5	7	2	0.001494	0.006027	0.000000	7.311300	0.000000	7.311300
8	6	7	1	0.000319	0.001164	0.000000	1.771300	0.000000	1.771300
9	6	7	2	0.000288	0.001081	0.000000	1.719200	0.000000	1.719200
10	10	11	1	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
11	10	11	2	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
12	11	1	1	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
13	11	1	2	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
14	9	8	1	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
15	9	8	2	0.000477	0.002142	0.000000	40.31640	0.000000	40.31640
];



% 1.线路前侧母线名 + 线路前侧节点基准电压 在 mpc.bus_name 中的序号
% 2.线路后侧母线名 + 线路后侧节点基准电压 在 mpc.bus_name 中的序号
% 3.线路回路号
% 4.线路前侧高抗对应等值零序电抗（pu）
% 5.线路后侧高抗对应等值零序电抗（pu）
		
LOplus = [ 
1	11	1	1     	0.243200	0.000000
2	1	11	2     	0.243200	0.000000
3	1	2	2     	0.243200	0.000000
4	2	1	1     	0.243200	0.000000
5	5	7	1     	0.243200	0.000000
6	7	5	2     	0.243200	0.000000
7	10	11	2     	0.243200	0.000000
8	11	10	1     	0.243200	0.000000
];


%% bus names
mpc.bus_name = {
	'B01     	525.0',1;
	'B02     	525.0',2;
	'B03     	525.0',3;
	'B04     	525.0',4;
	'B05     	525.0',5;
	'B06     	525.0',6;
	'B07     	525.0',7;
	'B08     	525.0',8;
	'B09     	525.0',9;
	'B10     	525.0',10;
	'B11     	525.0',11;
	'B12     	230.0',12;
	'B13     	230.0',13;
	'B14     	230.0',14;
	'B17     	230.0',15;
	'B18     	230.0',16;
	'B19     	230.0',17;
	'B21     	230.0',18;
	'B22     	230.0',19;
	'B24     	230.0',20;
	'B25     	230.0',21;
	'B26     	230.0',22;
	'B28     	230.0',23;
	'B29     	230.0',24;
	'B33     	230.0',25;
	'B37     	37.00',26;
	'B38     	37.00',27;
	'B43     	37.00',28;
	'B44     	37.00',29;
	'B45     	37.00',30;
	'B46     	37.00',31;
	'B47     	37.00',32;
	'B50     	37.00',33;
	'B51     	37.00',34;
	'B52     	37.00',35;
	'B55     	37.00',36;
	'B57     	37.00',37;
	'B58     	37.00',38;
	'B59     	37.00',39;
	'B62     	37.00',40;
	'B63     	37.00',41;
	'B68     	37.00',42;
	'B74     	37.00',43;
	'DN01    	210.0',44;
	'DN02    	199.0',45;
	'DP01    	210.0',46;
	'DP02    	199.0',47;
	'PV03-1  	0.400',48;
	'PV03-2  	0.400',49;
	'PV05-1  	0.400',50;
	'PV06-1  	0.400',51;
	'PV06-2  	0.400',52;
	'T3-01   	1.000',53;
	'T3-02   	1.000',54;
	'T3-03   	1.000',55;
	'T3-05   	1.000',56;
	'T3-07   	1.000',57;
	'T3-09   	1.000',58;
	'T3-11   	1.000',59;
	'T3-12   	1.000',60;
	'T3-13   	1.000',61;
	'T3-14   	1.000',62;
	'T3-16   	1.000',63;
	'T3-17   	1.000',64;
	'T3-22   	1.000',65;
	'TP03-1  	20.00',66;
	'TP04-1  	20.00',67;
	'TP06-1  	20.00',68;
	'TP09-1  	20.00',69;
	'TP09-2  	20.00',70;
	'TP10-1  	20.00',71;
	'TP11-1  	20.00',72;
	'WT04-1  	0.690',73;
	'WT04-2  	0.690',74;
	'WT05-1  	0.690',75;
	'WT05-2  	0.690',76;
};
%% bus zones
mpc.zonemap = {
	'0',1;
	'1S',2;
	'CG',5;
	'FD',6;
	'FH',3;
	'GF',4;
};
%% otherstring
mpc.other_string = {
	'1',1;
	'2',2;
	'3',3;
	'A',4;
	'S',5;
};
%% mode id
mpc.mode_id = {
	'1',1;
	'2',2;
};
