
% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID，风电机识别码 在 mpc.mode_id 中的索引
% PPER，有功发电比例（0~1）
% QPER，无功发电比例（0~1）
% MVA，单个光伏阵列的额定容量（MVA）
% T，实际温度（°C；缺省25）
% Uoc，单体电池标准条件下的开路电压（V）
% Isc，单体电池标准条件下的短路电流（A）
% Upmax，最大功率点的电压（V）
% Ipmax，最大功率点的电流（A）
% ISHT，光伏阵列的并联电池组数
% ISER，光伏阵列每组光伏电池组的串联单体光伏电池数
% C，直流侧电容大小（mF）
% NM，组数

MS = [ 
1	61	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	400
2	62	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	400
3	63	0     	0.00	0.00	1.050	15.000	44.800	8.3300	35.200	7.9500	127 	28  	1000000000.000000	400
];



% NAME；风电机组名称
% BASE；风电机组额定电压（kV）
% ID；识别码 在 mpc.mode_id 中的索引
% T1；测量时间常数（秒）
% KPUDC；直流电压PI控制比例系数
% KIUDC；直流电压PI控制积分系数
% MAXID；PI控制环节最大限幅（共用）
% MINID；PI控制环节最小限幅（共用）
% TPC；时间常数（s）
% PMAX；功率最大限制（pu；相对额定功率的标么值）
% PMIN；功率最小限制（pu；相对额定功率的标么值）
% dP/dtMAX；功率最大变化率（pu/s；相对额定功率的标么值）
% dP/dtMIN；功率最小变化率（pu/s；相对额定功率的标么值）
% PCON_TYP；功率控制方式；=0；定直流电压控制（详细计算使用）；=1；恒功率控制（简化计算使用）
% KPP；恒功率PI控制环节系数
% KIP；恒功率PI控制环节时间常数（秒）

EU = [ 
1	88	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
2	90	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
3	85	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
4	87	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
5	61	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
6	62	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
7	63	0     	0.0200	2.0000	0.1000	1.0000	-1.000	0.0000	0.0000	0.0000	0.0000	0.0000	0	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；风电机识别码 在 mpc.mode_id 中的索引
% RC；电压补偿电阻标么值
% XC；电压补偿电抗标么值
% TR；电压测量时间常数(s)
% KPV；比例环节系数
% KPI；积分环节系数
% QMAX；无功最大限制(pu)
% QMIN；无功最小限制(pu)
% TV；时间常数(s)
% TPV；时间常数(s)
% IPF；=0；电压控制方式；=1采用恒功率因数控制方式
% TPE；时间常数(s)
% NAME；控制节点名称 + BASE；控制节点基准电压（kV）在 mpc.bus_name 中的索引

EZ = [ 
1	88	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
2	90	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
3	85	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
4	87	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
5	61	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
6	62	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
7	63	0     	0.0000	0.0000	0.0200	18.000	5.0000	0.4360	-0.436	0.1500	0.0500	1	0.0000	0
8	89	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
9	86	0     	0.0000	0.0000	0.0200	18.000	5.0000	1.1000	-1.100	0.0200	0.0000	1	0.0000	0
];



% NAME；风电机组名称
% BASE；风电机组额定电压（kV）
% ID；识别码 在 mpc.mode_id 中的索引
% IMAX；最大电流限制（pu；本机额定容量为基准）
% Idmax；有功电流最大限制（pu；本机额定容量为基准）
% Iqmax；无功电流最大限制（pu；本机额定容量为基准）
% IPQ_LOW；低电压期间无功控制优先标志（=0；无功优先；=1；有功优先）
% IPQ_HIGH；高电压期间无功控制优先标志（=0；有功优先；=1；无功优先）
% IMAX_FLG；低电压穿越期间总电流限制方式（=0；不变；=1；按照初值的比例设定）
% IMAX_PER；低穿期间最大电流限制与初始电流的比例
% KQP；无功控制比例系数（pu；本机额定容量为基准）
% KQI；无功控制积分系数（pu；本机额定容量为基准）
% dQmax；无功控制环节限幅最大值（pu；本机额定容量为基准）
% dQmin；无功控制环节限幅最小值（pu；本机额定容量为基准）
% Tdelay；电流注入时间延时（s）

ES = [ 
1	88	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
2	90	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
3	85	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
4	87	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
5	61	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
6	62	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
7	63	0     	1.2000	1.2000	1.2000	0	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
8	89	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
9	86	0     	1.1000	1.1000	1.1000	0	1	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000
];



% NAME 风电机组名称
% BASE 风电机组额定电压（kV）
% ID；识别码 在 mpc.mode_id 中的索引
% VOL_TYP；判断故障穿越的电压类型（=0；正序电压；=1；最小或最大相电压）
% VOL_LOW；判断进入低电压穿越状态的电压值（pu）
% VOL_LOW_RET；判断退出低电压穿越状态的电压值（pu）
% VOL_LOW_DELAY；低电压判断时间（周波）
% VOL_HIGH；判断进入高电压穿越状态的电压值（pu）
% VOL_HIGH_RET；判断退出高电压穿越状态的电压值（pu）
% VOL_HIGH_DELAY；高电压判断时间（周波）

EV = [ 
1	88	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
2	90	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
3	85	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
4	87	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
5	61	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
6	62	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
7	63	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
8	89	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
9	86	0     	0	0.9000	0.9000	0.0000	1.3000	1.3000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% 参数组标志；含义见说明书（共8种：L、H、S、T、M、N、U、V）在 mpc.other_string 中的索引
% 参数组填法标志；B表示BPA填法；P表示PSASP填法 在 mpc.other_string 中的索引
% IRT_CON；电压恢复过程中是否再次进入故障穿越过程的标志；=0进入；=1不进入
% IP_FLG；故障穿越期间的有功控制方式（=0指定电流；=1指定电流百分比；=2指定功率；=3指定功率百分比）
% IP_SET1；故障穿越期间的有功电流或功率控制值
% TDELAY；故障穿越期间进入功率保持的延时（周波）
% IP_FLG2；穿越后设定有功爬坡初始值的方式（=0指定电流；=1指定电流百分比；=2指定功率；=3指定功率百分比）
% IP_SET2；穿越后设定有功爬坡的初始值
% IP_TIM2；穿越后维持设定的初始电流或功率的时间（周波）
% IP_RATE_FLG；穿越后有功爬坡过程的方式（=0；立即恢复=1；按照指定斜率上升；填写42-56列=2；按照抛物线的方式上升；填写57-61列=3；按照指定时间斜线上升；填写57-61列）
% IP_RATE；穿越后爬坡过程中；有功电流或功率上升速率（A/s或MW/s）（= -1.0；立即恢复到故障发生前的数值
% IP_RATE2；穿越后爬坡过程中；有功电流或功率上升的慢速速率（A/s或MW/s）
% P_RATE_CHANGE；爬坡过程中上升速率由41-45列速率转换为46-50列速率的功率或者电流值相对初值的比例
% TP；恢复时间常数（s；对应从0恢复到额定功率的时间）
% IPI_COM；不对称故障期间有功电流的控制方式（0和三相故障一致；1根据正序电压计算有功电流限制）
% PILIM_K1；正序电流限幅计算系数1
% PILIM_K2；正序电流限幅计算系数2
% IP_RATE_FLG2；不对称故障后有功爬坡方式（0和三相故障一致；1根据正序电压计算有功电流限制）

LP = [ 
1	88	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
2	90	0     	0     	0     	1	1	50.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
3	85	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
4	87	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
5	61	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
6	62	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
7	63	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
8	89	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
9	86	0     	0     	0     	1	1	40.000	0.000	0	-1.000	0.0000	1	4.5000	0.0000	0.0000	0.5000	0	0.0000	0.0000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% 参数组标志；含义见说明书（共8种：L、H、S、T、M、N、U、V） 在 mpc.other_string 中的索引
% 参数组填法标志；B表示BPA填法；P表示PSASP填法  在 mpc.other_string 中的索引
% ICON_TYP；三相对称条件下的无功控制方式=0；采用电压控制无功电流的方式；=2；指定无功功率值；=3；指定无功电流值。
% VOLTYP；选择的最小电压类型；=0正序电压；=1相电压
% VOL_REF；计算无功电流的电压参考值（pu）；缺省0.9pu
% Q_RATE；19列为0时；填写无功调整系数（pu）19列为2时；填写无功功率值（Mvar）19列为3时；填写无功电流值（A）
% ICONTYP2；三相不对称条件下的无功控制方式：=0没有无功输出；=1指定固定值；=2采用和正序相同的控制方式；=3采用负序电压控制；=4采用正序和负序电压共同控制
% KQ2；采用负序电压控制时；计算电流参考值的系数
% IQMAX；不对称时；无功电流最大限制（A）；当31列为1时；无功电流指定值（A）
% IQ_FLG；穿越后的无功控制方式：=0不控制；恢复初始状态；=1保持一定值一段时间；=2以指数形式下降；=3以斜线形式下降
% IQ_START；穿越后无功下降的开始电流或者保持的电流（A）
% IQ_TP；降低的时间常数或者保持的时间（s）
% IQLIM；无功电流最大限制（A）

LQ = [ 
1	88	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
2	90	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
3	85	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
4	87	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
5	61	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
6	62	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
7	63	0     	0     	0     	0	0	0.9000	1.2000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
8	89	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
9	86	0     	0     	0     	0	0	0.9000	1.5000	2	0.0000	1500.0	0	0.0000	0.0000	1500.0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 发电机ID 在 mpc.mode_id 中的索引
% 电压设定值1(pu)(不能为1/大于1为过电压/小于1为低电压)
% 设定值1延迟时间(周波)
% 电压设定值2(pu)
% 设定值2延迟时间(周波)
% 电压设定值3(pu)
% 设定值3延迟时间(周波)
% 电压设定值4(pu)
% 设定值4延迟时间(周波)
% 电压设定值5(pu)
% 设定值5延迟时间(周波)
% 继电器动作时间(周波)
% 控制节点名称(不为空时表示实际参与判断的母线) + 控制节点基准电压(kV) 在 mpc.bus_name 中的索引

% 电压设定值6(pu)(不能为1/大于1为过电压/小于1为低电压)
% 设定值6延迟时间(周波)
% 电压设定值7(pu)
% 设定值7延迟时间(周波)
% 电压设定值8(pu)
% 设定值8延迟时间(周波)
% 电压设定值9(pu)
% 设定值9延迟时间(周波)
% 电压设定值10(pu)
% 延迟时间10（周波）

RE_REplus = [ 
1	88	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
2	90	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
3	85	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
4	87	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
5	61	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
6	62	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
7	63	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	7.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
8	89	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
9	86	0     	0.9000	100.0	0.7500	85.30	0.5000	60.70	0.3500	46.00	0.2000	0.500	0.000	0	1.1000	500.0	1.2000	50.00	1.2500	25.00	1.3000	0.500	0.0000	0.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；风电机识别码 在 mpc.mode_id 中的索引
% PCON_TYP；功率控制方式（=0；转速控制；=1；恒转矩控制；=2；恒功率控制）
% TPE；时间常数（s）
% KPTRQ；转矩控制环节的比例环节系数
% KITRQ；转矩控制环节的积分环节系数
% TPC；时间常数（s）
% PMAX；功率最大限制（pu；相对额定功率的标么值）
% PMIN；功率最小限制（pu；相对额定功率的标么值）
% dP/dtMAX；功率最大变化率（pu/s；相对额定功率的标么值）
% dP/dtMIN；功率最小变化率（pu/s；相对额定功率的标么值）
EP = [ 
1	89	0     	2	60.000	3.0000	0.6000	0.0500	1.0000	0.0400	0.4500	-0.450
2	86	0     	2	60.000	3.0000	0.6000	0.0500	1.0000	0.0400	0.4500	-0.450
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；风电机识别码 在 mpc.mode_id 中的索引
% Tr；转速测量时间常数（秒）
% Kp；转速控制比例环节系数（p.u.）
% KI；转速控制积分环节系数（p.u.）
% Tpr；电磁功率测量时间常数（秒）
% Kpp；电磁功率比例环节系数（p.u.）
% Kpi；电磁功率积分环节系数（p.u.）
% TP；伺服时间常数（秒）
% DBETA_MAX；桨距角的最大变化速度（度/秒）
% DBETA_MIN；桨距角的最小变化速度（度/秒）
% BETA_MAX；桨距角最大限制（度）
% BETA_MIN；桨距角最小限制（度）
% INPTYP；控制量选择（=0；输入转速和电磁功率；=1；输入转速；=2；输入电磁功率）

GF = [ 
1	89	0     	0.0200	150.00	25.000	0.0200	3.0000	30.000	0.3000	10.000	-10.00	30.000	0.0000	1
2	86	0     	0.0200	150.00	25.000	0.0200	3.0000	30.000	0.3000	10.000	-10.00	30.000	0.0000	1
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；风电机识别码 在 mpc.mode_id 中的索引
% V_cutin；切入风速（m/s）
% V_cutout；切出风速（m/s）
% V_init；初始风速（m/s）
% ρ；空气密度（kg/m3）
% R；叶片扫风半径（m）
% ρAr/2
% KB；计算页尖速率比的系数
% ΩN；叶片额定机械角速度（rad/s）
% ICP；风能转换效率系数CP的计算方法选择
% B；叶片数（定浆矩系统）
% L/D；升力比（定浆矩系统）或Cf；叶片设计常数（变浆矩系统）
% AMIN；最小桨矩角（度）（变浆矩系统）
% TH；轮毂时滞效应的时间常数

TG = [ 
1	89	0     	3.0000	20.000	0.0000	1.2250	44.550	0.00000	0.0000	0.0000	0	0 	0.0000	0.0000	0.0000
2	86	0     	3.0000	20.000	0.0000	1.2250	44.550	0.00000	0.0000	0.0000	0	0 	0.0000	0.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；风电机识别码 在 mpc.mode_id 中的索引
% ITWO_MASS；=0；单质量块模型；否则采用双质量块模型
% J_GEN；发电机转动惯量（kg.m2）
% J_turbine；风轮及叶片转动惯量（kg.m2）
% Ktg；刚性系数（106 Nm/rad）
% Dtg；阻尼系数（106 Nm/rad）
% p；发电机极对数
% Ngear；齿轮箱变比（高速轴相对低速轴）
% FLAG；变速抽蓄机组模型标志（=0或不填；风机；=8；双馈抽蓄；=9；全变流抽蓄）

ME = [ 
1	89	0     	0	58.0000	4857143.000	88.7000	0.25000	2.00	106.000	0
2	86	0     	0	58.0000	4857143.000	88.7000	0.25000	2.00	106.000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% PPER；有功比例（占潮流总出力的比例；缺省1.0）
% QPER；无功比例（占潮流总出力的比例；缺省1.0）
% MVABASE；额定容量（MVA）
% Rs；定子电阻标么值（本机额定容量为基准）
% Xs；定子电抗标么值（本机额定容量为基准）
% Xm；激磁电抗标么值（本机额定容量为基准）
% Rr；转子电阻标么值（本机额定容量为基准）
% Xr；转子电抗标么值（本机额定容量为基准）
% VC0；换流器直流侧电容初始电压（V）
% C；换流器直流侧电容（F）
% PN；额定功率（MW）
% NG；机组台数
% Td0p；时间常数（s）
% FLAG；发电机处理方式标志（=0；简化电流源；=1；详细电机；=2；简化电压源；=8；双馈抽蓄；=9；全变流抽蓄）

MM = [ 
1	89	0     	1.00	1.00	1.600	0.0114	0.0752	3.9270	0.0104	0.1469	0.0000	1070.0	0.20000	1.500	267	0
2	86	0     	1.00	1.00	1.600	0.0114	0.0752	3.9270	0.0104	0.1469	0.0000	1070.0	0.20000	1.500	267	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% PPER；有功比例（占潮流总出力的比例；缺省1.0）
% QPER；无功比例（占潮流总出力的比例；缺省1.0）
% MVABASE；风电机组额定容量（MVA）
% VC0；换流器直流侧电容初始电压（V）
% C；换流器直流侧电容（F）
% PN；额定功率（MW）
% NG；风电机台数

MY = [ 
1	88	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	267
2	90	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	267
3	85	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	267
4	87	0     	1.00	1.00	1.600	0.0000	1000.0	1000000000.000000	1.500	267
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 电机识别码
% 发电机动能(MW*秒)
% 发电机初始有功功率占母线潮流功率百分数
% 发电机初始无功功率占母线潮流功率百分数
% 电机标么参数的基准容量
% 定子电阻(标么值)
% 直轴暂态电抗Xdp(标么值)
% 交轴暂态电抗Xqp(标么值)
% 直轴不饱和同步电抗Xd(标么值)
% 交轴不饱和同步电抗Xq(标么值)
% 直轴暂态开路时间常数Tdop(秒)
% 交轴暂态开路时间常数Tqop(秒)
% 定子漏抗(标么值)
% 额定电压时电机饱和系数
% 1.2倍额定电压时电机饱和系数
% 电机阻尼转距系数百分数

MC = [ 
1	20	0     	999999	0.00	0.00	1100	0.000	0.0001	0.0000	0.0000	0.0000	0.000	0.00	0.0000	0.0000	0.000	0.00
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 电机识别码
% 电机功率因数
% 发电机阻尼绕组
% 所有者
% Xd''直轴暂态电抗Xdpp(标么值)
% Xq''交轴暂态电抗Xqpp(标么值)
% Td0''直轴次暂态时间常数Td0pp(秒)
% Tq0''交轴次暂态时间常数Tq0pp(秒)

% 发电机动能(MW*秒)
% 发电机初始有功功率占母线潮流功率百分数
% 发电机初始无功功率占母线潮流功率百分数
% 电机标么参数的基准容量
% 定子电阻(标么值)
% 直轴暂态电抗Xdp(标么值)
% 交流暂态电抗Xqp(标么值)
% 直轴不饱和同步电抗Xd(标么值)
% 交轴不饱和同步电抗Xq(标么值)
% 直轴暂态开路时间常数Tdop(秒)
% 交轴暂态开路时间常数Tqop(秒)
% 饱和N
% 饱和a
% 饱和b
% 电机阻尼转距系数百分数

M_MG = [ 
1	81	0     	0.90	0     	0     	0.2510	0.2470	0.045	0.066	0.0000	0.0000	1875.40	0.00	0.00	733.0	0.000	0.3360	0.4850	2.3800	2.3200	8.610	0.96	9.0000	0.9000	0.000	0.00
2	82	0     	0.90	0     	0     	0.2510	0.2470	0.045	0.066	0.0000	0.0000	1875.40	0.00	0.00	733.0	0.000	0.3360	0.4850	2.3800	2.3200	8.610	0.96	9.0000	0.9000	0.000	0.00
3	83	0     	0.90	0     	0     	0.2510	0.2470	0.045	0.066	0.0000	0.0000	1875.40	0.00	0.00	733.0	0.000	0.3360	0.4850	2.3800	2.3200	8.610	0.96	9.0000	0.9000	0.000	0.00
4	84	0     	0.90	0     	0     	0.2510	0.2470	0.045	0.066	0.0000	0.0000	1875.40	0.00	0.00	733.0	0.000	0.3360	0.4850	2.3800	2.3200	8.610	0.96	9.0000	0.9000	0.000	0.00
5	65	0     	0.00	0     	0     	0.1110	0.1100	0.050	0.096	0.1095	0.0951	448.500	0.00	0.00	300.0	0.000	0.1650	0.3170	1.5350	1.3940	8.960	0.83	78769	1.0000	0.137	0.00
6	64	0     	0.00	0     	0     	0.1110	0.1100	0.050	0.096	0.1095	0.0951	448.500	0.00	0.00	300.0	0.000	0.1650	0.3170	1.5350	1.3940	8.960	0.83	78769	1.0000	0.137	0.00
7	0	0     	0.00	0     	0     	0.1110	0.1100	0.050	0.096	0.1095	0.0951	448.500	0.00	0.00	300.0	0.000	0.1650	0.3170	1.5350	1.3940	8.960	0.83	78769	1.0000	0.137	0.00
8	0	0     	0.00	0     	0     	0.1110	0.1100	0.050	0.096	0.1095	0.0951	448.500	0.00	0.00	300.0	0.000	0.1650	0.3170	1.5350	1.3940	8.960	0.83	78769	1.0000	0.137	0.00
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 3.ID 电机识别码 在 mpc.mode_id 中的索引
% 4.PSS信号接入点选择
% RC 负载补偿之有功关分量（标么值）
% XC 负载补偿之有功关分量（标么值）
% TR 调节器输入滤波器时间常数（秒）
% K 调节器增益（标么值）
% KV 比例积分或纯积分调节选择因子
% T1 电压调节器时间常数（秒）
% T2 电压调节器时间常数（秒）
% T3 电压调节器时间常数（秒）
% T4 电压调节器时间常数（秒）
% KA 调压器增益（标么值）
% TA 调压器放大器的时间常数（秒）
% KF 调压器稳定回路增益（标么值）
% TF 调压器稳定回路时间常数（秒）
% KH 励磁机电流反馈增益（标么值）

% VAMAX 调节器最大内部电压(标值)
% VAMIN 调节器最小内部电压(标值)
% KB 第二级调节器增益
% T5 第二级调节器时间常数
% KE 励磁机自励磁系数（标么值）
% TE 励磁机时间常数（秒）
% SE1 最大励磁电压处的励磁机饱和系数
% SE2 75％最大励磁电压处的励磁机饱和系数
% VRMAX 电压调节器最大输出（标么值）
% VRMIN 电压调节器最小输出（标么值）
% KC 换相电抗的整流器负载因子
% KD 去磁因子（标么值）
% KL1 励磁机励磁电流限制增益（标么值）
% VL1R 励磁机电流限制（标么值）
% EFDMAX 最大励磁电压（标么值）

FV_Fplus = [ 
1	81	0     	0	0.000	-0.05	0.0200	20.000	0.00	3.0000	1.0000	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.260    -5.30    0.103    0.000    0.000    0.000    0.000
2	82	0     	0	0.000	-0.05	0.0200	20.000	0.00	3.0000	1.0000	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.260    -5.30    0.103    0.000    0.000    0.000    0.000
3	83	0     	0	0.000	-0.05	0.0200	20.000	0.00	3.0000	1.0000	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.260    -5.30    0.103    0.000    0.000    0.000    0.000
4	84	0     	0	0.000	-0.05	0.0200	20.000	0.00	3.0000	1.0000	0.1000	0.1000	1.0000	0.0100	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    7.260    -5.30    0.103    0.000    0.000    0.000    0.000
5	65	0     	0	0.000	0.000	0.0200	56.250	1.00	1.0000	10.000	0.0400	0.0300	14.200	0.0200	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    11.20    -10.0    0.093    0.000    0.000    0.000    0.000
6	64	0     	0	0.000	0.000	0.0200	56.250	1.00	1.0000	10.000	0.0400	0.0300	14.200	0.0200	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    11.20    -10.0    0.093    0.000    0.000    0.000    0.000
7	0	0     	0	0.000	0.000	0.0200	56.250	1.00	1.0000	10.000	0.0400	0.0300	14.200	0.0200	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    11.20    -10.0    0.093    0.000    0.000    0.000    0.000
8	0	0     	0	0.000	0.000	0.0200	56.250	1.00	1.0000	10.000	0.0400	0.0300	14.200	0.0200	0.0000	1.000	0.000        10.000    -10.00    0.000    0.000    0.000    0.000    0.0000    0.0000    11.20    -10.0    0.093    0.000    0.000    0.000    0.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 识别码ID 在 mpc.mode_id 中的索引，当一母线上有多台机时用ID来识别
% TRW
% T5
% T6
% T7
% KR
% TRP
% TW
% TW1
% TW2
% KS
% T9
% T10
% T12
% 0或者空格输入信号为w和PG；1输入信号只有；2输入信号只有PG

% KP
% T1
% T2
% T13
% T14
% T3
% T4
% VSMAX
% VSMIN
% 零或空格输入信号发电机速度偏差1母线频率偏差
% 输入母线频率信号对应的母线名称 + BUS_BSE (在 mpc.bus_name 中的索引)
% SI卡中的KR的基准容量(MVA)

SI_SIplus = [ 
1	81	0     	0.020	5.0000	5.0000	5.0000	0.13640	0.020	0.9200	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	6.0000	0.1300	0.0200	0.1000	0.1000	0.1200	0.0200	0.10000	-0.1000	0	0	100.0
2	82	0     	0.020	5.0000	5.0000	5.0000	0.13640	0.020	0.9200	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	6.0000	0.1300	0.0200	0.1000	0.1000	0.1200	0.0200	0.10000	-0.1000	0	0	100.0
3	83	0     	0.020	5.0000	5.0000	5.0000	0.13640	0.020	0.9200	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	6.0000	0.1300	0.0200	0.1000	0.1000	0.1200	0.0200	0.10000	-0.1000	0	0	100.0
4	84	0     	0.020	5.0000	5.0000	5.0000	0.13640	0.020	0.9200	5.0000	5.0000	1.000	0.6000	0.1200	0.1200	0	6.0000	0.1300	0.0200	0.1000	0.1000	0.1200	0.0200	0.10000	-0.1000	0	0	100.0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 发电机识别码 在 mpc.mode_id 中的索引
% Pe原动机额定输出功率（MW）
% Tc油动机关闭时间常数
% To油动机开启时间常数
% VELclose过速关闭系数(pu)
% VELopen过速开启系数(pu)
% PMAX最大原动机输出功率（油动机最大行程或调门最大开度）(pu)
% PMIN最小原动机输出功率（油动机最小行程或调门最小开度）(pu)
% T1油动机行程反馈环节（LVDT）时间
% KP比例放大倍数
% KD (Td)微分倍数
% KI (1/Ti)积分倍数
% INTG_MAX积分上限
% INTG_MIN积分下限
% PID_MAX输出上限
% PID_MIN输出下限

% PGV_DELAY 功率输出信号的纯延迟时间（秒）

GA_GAplus = [ 
1	81	0     	660.000	10.00	8.000	-1.00	1.000	1.030	0.000	0.020	20.00	0.000	1.000	1.000	-1.00	1.000	-1.00	0.0000
2	82	0     	660.000	10.00	8.000	-1.00	1.000	1.030	0.000	0.020	20.00	0.000	1.000	1.000	-1.00	1.000	-1.00	0.0000
3	83	0     	660.000	10.00	8.000	-1.00	1.000	1.030	0.000	0.020	20.00	0.000	1.000	1.000	-1.00	1.000	-1.00	0.0000
4	84	0     	660.000	10.00	8.000	-1.00	1.000	1.030	0.000	0.020	20.00	0.000	1.000	1.000	-1.00	1.000	-1.00	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 发电机识别码
% 转速测量环节时间常数T1（秒）一般取0.01秒、0.02秒或0.05秒
% 转速偏差死区ε（相对系统频率的标么值死区为±0.5ε）
% 转速偏差放大倍数K1一般取22.2考虑到部分机组没有投入负荷反馈计算中可取18~20
% 控制方式选择（各种方式下一次调频均能自动投入）1 - 调节级压力反馈控制；2 -  DEH开环控制;3 - 负荷反馈控制;此值必须填写无缺省值
% PID比例环节倍数KP
% PID微分环节倍数KD
% PID积分环节倍数KI
% PID积分环节限幅上限INTG_MAX
% PID积分环节限幅下限INTG_MIN
% PID输出限幅环节的上限PID_MAX
% PID输出限幅环节的下限PID_MIN
% K2 负荷控制前馈系数取值0 ~ 1
% 一次调频负荷上限:0.05~0.1
% 一次调频负荷下限:-1

% 频率输入信号的纯延时时间（秒）
% 功率反馈信号的纯延时时间（秒）
% 功率反馈信号对应的一阶惯性环节时间常数（秒）
% 频率信号放大后的纯延时时间（秒）
% 频率信号放大后输入PID的纯延时时间（秒）
% 频率信号放大后输入PID信号的上升速率限制（pu/秒）
% 频率信号放大后输入PID信号的下降速率限制（pu/秒）

GJ_GJplus = [ 
1	81	0     	0.0200	0.00130	22.000	3	0.5000	0.0000	0.1500	1.000	-1.00	1.000	-1.00	0.7000	0.0100	-0.010	0.0000	0.0000	0.0200	0.2000	0.2000	9999.0	-9999
2	82	0     	0.0200	0.00130	22.000	3	0.5000	0.0000	0.1500	1.000	-1.00	1.000	-1.00	0.7000	0.0100	-0.010	0.0000	0.0000	0.0200	0.2000	0.2000	9999.0	-9999
3	83	0     	0.0200	0.00130	22.000	3	0.5000	0.0000	0.1500	1.000	-1.00	1.000	-1.00	0.7000	0.0100	-0.010	0.0000	0.0000	0.0200	0.2000	0.2000	9999.0	-9999
4	84	0     	0.0200	0.00130	22.000	3	0.5000	0.0000	0.1500	1.000	-1.00	1.000	-1.00	0.7000	0.0100	-0.010	0.0000	0.0000	0.0200	0.2000	0.2000	9999.0	-9999
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID电机识别码 在 mpc.mode_id 中的索引
% TCH蒸汽容积时间常数(秒)
% FHP高压缸功率比例
% TRH再热器时间常数
% FIP中压缸功率比例
% TCO交叉管时间常数
% FLP低压缸功率比例
% 高压缸功率自然过调系数

TB = [ 
1	81	0     	0.1000	0.3300	18.000	0.6700	0.0000	0.0000	1.000
2	82	0     	0.1000	0.3300	18.000	0.6700	0.0000	0.0000	1.000
3	83	0     	0.1000	0.3300	18.000	0.6700	0.0000	0.0000	1.000
4	84	0     	0.1000	0.3300	18.000	0.6700	0.0000	0.0000	1.000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码ID在 mpc.mode_id 中的索引；当一母线上有多台机时；用ID来识别
% KQV；滤波器增益
% TQV；滤波器时间常数（s）
% TQ1；超前时间常数1（s）
% TQ1P；滞后时间常数1（s）
% TQ2；超前时间常数2（s）
% TQ2P；滞后时间常数2（s）
% TQ3；超前时间常数3（s）
% TQ3P；滞后时间常数3（s）
% VSMAX；输出限幅高值（pu）
% VSMIN；输出限幅低值（pu）
% 受控母线节点名 + 受控母线基准电压（kV）(在 mpc.bus_name 中的索引)

SV = [ 
1	65	0     	1.2000	0.1000	0.2000	0.5000	1.0000	1.0000	1.0000	1.0000	0.1000	-0.100	0
2	64	0     	1.2000	0.1000	0.2000	0.5000	1.0000	1.0000	1.0000	1.0000	0.1000	-0.100	0
3	0	0     	1.2000	0.1000	0.2000	0.5000	1.0000	1.0000	1.0000	1.0000	0.1000	-0.100	0
4	0	0     	1.2000	0.1000	0.2000	0.5000	1.0000	1.0000	1.0000	1.0000	0.1000	-0.100	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% 必须为空(分区名)
% 必须为空(区域名)
% 恒定阻抗有功负荷百分数
% 恒定阻抗无功负荷百分数
% 恒定电流有功负荷百分数
% 恒定电流无功负荷百分数
% 恒定功率有功负荷百分数
% 恒定功率无功负荷百分数
% 频率变化1％引起的有功变化
% 频率变化1％引起的无功变化

LB = [ 
1	0	1     	0     	0.5100	0.5100	0.3400	0.3400	0.1500	0.1500	1.0000	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% G_max最大触发角控制增益
% T_amax最大触发角控制时间常数
% Gammaref熄弧角参考值
% Gammamin最小熄弧角
% Kp_vca定电压控制比例增益
% Ti_vca定电压控制积分时间常数
% 整流侧最小触发角控制增益1
% 整流侧最小触发角控制增益2
% 整流侧最小触发角控制电压阈值1
% Dl整流侧最小触发角控制电压阈值2
% 最小触发角控制角度下降速率
% T_ga逆变侧Gamma0启动延时时间
% Alpha_retard直流移相触发角
% Th_retard直流移相时间
% Th_restart直流重启动延时时间
% DISA非空则消去该直流控制系统 在 mpc.other_string 中的索引
% DBG调试文件标志 在 mpc.other_string 中的索引

% MOD；控制方式；1=恒定功率控制；0=恒定电流控制
% LEAD；主控站；1=主控站；0=受控站
% GAMM0；GAMM0标志；1=投入状态；0=退出状态
% BC_ON；协调控制标志；1=双极协调；0=独立运行
% Udlow；VDCOL启动电压
% Udhigh；VDCOL退出电压
% Udtup；VDCOL电压上升滤波时间常数
% Udtdn；VDCOL电压下降滤波时间常数
% Iomin_vdcl；VDCOL最小插值电流指令
% Iomin；VDCOL最小电流指令
% Id_t；定电流控制电流滤波时间常数
% Gain；定电流控制总增益
% Kp；定电流控制比例增益
% Ti；定电流控制积分时间常数
% G_cf；换相失败预测增益
% K_cf；换相失败预测启动电压阈值
% T_dn_cf；换相失败预测输出角度下降时间常数
% Vno；逆变侧平衡站的优先级

% Ud_ref_min；低压限流门槛最小修正系数(pu)
% Uhgrepu；低压限流输入电压再标幺：南瑞=0；许继=1
% Udhigh_r；VDCOL修正系数：南瑞=1.0；许继=2.0

% Alpha_res直流重启动触发角
% PEN，逆变侧控功率/电流有效，=1为有效，=0或不填为无效
% UEN,换相失败电压判据有效，=1为有效，=0或不填为无效
% 换相失败电压临界值(pu)
% Gama_CF，换相失败最小Gama角（°）
% Udepr，降压重启动的电压设定值(p.u.)
% Ksov，短期过负荷倍数
% Tsov，短期过负荷时间(秒)
% Klov，长期过负荷倍数
% Tlov，长期过负荷时间(秒)
% Tflock_Rec，单层闭锁信号传递到整流侧的时间
% NameBC，双极协调工况下的对极节点名称
% BaseKvBC，双极协调工况下的对极节点基准电压（kV）
% Ucrm，逆变侧控功率（电流）换流器电压裕度设定值（p.u.）
% Icrm，逆变侧控功率（电流）换流器电流裕度设定值（p.u.）


DA_DZ_DAplus_DAsharp = [ 
1	57	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	164.0	0.150	0.034	0     	0     	1 	1 	1 	1 	0.300	0.800	0.060	0.002	0.500	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.7000	1.2000	3.0000	1.0500	7200.0	0.0300	59    	0.0000	0.0000
2	58	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	80.00	0.150	0.034	0     	0     	1 	0 	1 	1 	0.300	0.800	0.060	0.002	0.300	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.0000	1.2000	3.0000	1.0500	7200.0	0.0300	60    	0.0000	0.0000
3	59	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	164.0	0.150	0.034	0     	0     	1 	1 	1 	1 	0.300	0.800	0.060	0.002	0.500	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.7000	1.2000	3.0000	1.0500	7200.0	0.0300	57    	0.0000	0.0000
4	60	0.150	0.012	17.00	11.70	10.00	0.0004	0.850	0.700	30.00	30.00	0.370	0.0650	80.00	0.150	0.034	0     	0     	1 	0 	1 	1 	0.300	0.800	0.060	0.002	0.300	0.100	0.0011	30.00	2.800	0.011	0.055	0.750	0.020	0 	0.8000	0 	2.0000	60.000	0	0	0.0000	7.0000	0.0000	1.2000	3.0000	1.0500	7200.0	0.0300	58    	0.0000	0.0000
];



% ZONE分区名
% TJ马达的惯性时间常数(秒)
% Pper马达功率占母线有功负荷的比例
% KL马达的负载率
% PMIN马达的功率因数
% RS定子电阻(标么值)
% XS定子电抗(标么值)
% XM激磁电抗(标么值)
% RR转子电阻(标么值)
% XR转子电抗(标么值)
% VI马达低压释放的电压值
% TI马达低压释放时延(秒)
% A转矩方程常数
% B转矩方程常数
% IM马达滑差达到1时的处理方式
% Qper；马达无功占母线无功负荷的比例

MJ = [ 
1	1     	2.00000	0.30	116.0	0.00	0.0200	0.1800	3.4990	0.0200	0.1200	0.00	0.000	0.8500	0.0000	1	0.0000
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% ITYP；保护类型代码（=0；同时存在CROWBAR和CHOPPER；=1；只有CROWBAR相关参数有效；=2；只有CHOPPER相关参数有效）
% ICROWBAR_type；CROWBAR保护类型（=0；主动型；=1；被动型）
% ICROWBAR_CON_TYP；CROWBAR保护动作条件类型（=0；转子电流和直流电压；=1；转子电流；=2；直流电压）
% R；CROWBAR对应的电阻（pu；本机额定容量为基准）
% IROT_LIM；CROWBAR动作的转子电流限制（pu）
% IROT_RET；CROWBAR动作后退出的转子电流值（pu）
% IROT_DELAY；CROWBAR动作后返回的延迟时间（周波）CROWBAR返回判断转子电流的判断时间（周波）
% VDC_LIM；CROWBAR动作的直流电压值（V）
% VDC_RET；CROWBAR返回的直流电压值（V）
% VDC_DELAY；CROWBAR返回判断直流电压的延迟时间（周波）
% R；CHOPPER电阻（欧姆）
% ICHOPPER_FLG；CHOPPER动作方式（=0；超过62-65列电压；全部投入；小于66-69列电压；退出；=1；超过62-65列电压；开始部分投入；达到66-69列电压；全部投入）
% VDC_0；CHOPPER动作的直流电压1（V）
% VDC_1；CHOPPER动作的直流电压2（V）

MR = [ 
1	88	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
2	90	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
3	85	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
4	87	0     	2	0	0	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.0000	0.9000	0	1200	1050
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID电机识别码 在 mpc.mode_id 中的索引
% IFD∞、VFE发电机磁场长期允许电流（标么值）
% BR 过励发热允许值
% C过励恢复系数
% KL2过励限制回路增益（标么值）
% TL1过励限制回路时间常数（秒）
% TL2过励限制回路时间常数（秒）
% T允许的过励时间（秒）
% P1 低励限制曲线上第一点的有功功率（MW）
% Q1 低励限制曲线上第一点的无功功率（Mvar）
% P2低励限制曲线上第二点的有功功率（MW）
% Q2低励限制曲线上第二点的无功功率（Mvar）
% KH1低励限制回路增益（标么值）
% TH1低励限制回路时间常数（秒）
% TH2低励限制回路时间常数（秒）
% TYPE圆周型、Vin＝VFE有刷或无刷系统

EL = [ 
1	65	0     	2.4200	420.0	0.850	10.000	0.100	0.500	0.600	0.0000	0.0000	0.0000	0.0000	0.0000	0.000	0.000	0
2	64	0     	2.4200	420.0	0.850	10.000	0.100	0.500	0.600	0.0000	0.0000	0.0000	0.0000	0.0000	0.000	0.000	0
3	0	0     	2.4200	420.0	0.850	10.000	0.100	0.500	0.600	0.0000	0.0000	0.0000	0.0000	0.0000	0.000	0.000	0
4	0	0     	2.4200	420.0	0.850	10.000	0.100	0.500	0.600	0.0000	0.0000	0.0000	0.0000	0.0000	0.000	0.000	0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID 电机识别码 在 mpc.mode_id 中的索引
% KP；有功量测惯性滤波环节增益	
% TP；有功量测惯性滤波环节时间常数（秒）	
% Pmax；有功量测上限（pu）	
% Pmin；有功量测下限（pu）	
% Umax；电压输入上限（pu）	
% Umin；电压输入下限（pu）	
% Tact；欠励动作延时（秒）	
% Kqc；增益	
% Tqc1；超前时间（秒）	
% Tqc2；滞后时间（秒）	
% Qcmax；欠励输出上限（pu）	
% Qcmin；欠励输出下限（pu）	
% Qcdead；欠励返回条件（pu）	
% Trtn；欠励返回延时（秒）	
% Sn；机组额定容量（MVA）	

% P1（MW）
% Q1（MVAR）
% P2（MW）
% Q1（MVAR）
% P3（MW）
% Q3（MVAR）
% P4（MW）
% Q4（MVAR）
% P5（MW）
% Q5（MVAR）
% P6（MW）
% Q6（MVAR）
% P7（MW）
% Q7（MVAR）

EN_ENplus = [ 
1	65	0     	1.000	5.000	99.00	-99.0	99.00	-99.0	0.060	10.00	0.000	60.00	0.1000	0.0000	0.0300	1.000	300.00	0.000	-150.0	50.00	-150.0	100.0	-150.0	150.0	-150.0	200.0	-150.0	250.0	-150.0	300.0	-150.0
2	64	0     	1.000	5.000	99.00	-99.0	99.00	-99.0	0.060	10.00	0.000	60.00	0.1000	0.0000	0.0300	1.000	300.00	0.000	-150.0	50.00	-150.0	100.0	-150.0	150.0	-150.0	200.0	-150.0	250.0	-150.0	300.0	-150.0
3	0	0     	1.000	5.000	99.00	-99.0	99.00	-99.0	0.060	10.00	0.000	60.00	0.1000	0.0000	0.0300	1.000	300.00	0.000	-150.0	50.00	-150.0	100.0	-150.0	150.0	-150.0	200.0	-150.0	250.0	-150.0	300.0	-150.0
4	0	0     	1.000	5.000	99.00	-99.0	99.00	-99.0	0.060	10.00	0.000	60.00	0.1000	0.0000	0.0300	1.000	300.00	0.000	-150.0	50.00	-150.0	100.0	-150.0	150.0	-150.0	200.0	-150.0	250.0	-150.0	300.0	-150.0
];



% 1.模型序号
% 2.busname 在 mpc.bus_name 中的序号
% ID；识别码 在 mpc.mode_id 中的索引
% LEID；配电网支路序号
% 马达的有功功率（MW）
% 马达的无功功率（Mvar）
% 马达的机械功率（MW）
% 马达的滑差
% 马达的端电流（A）
% 马达的内电势Ed'
% 马达的内电势Eq'
% 马达的加速功率（MW）

OMI = [ 
1	33	0     	0	3	3	3	3	0	0	0	0
];



% TMINPRONY算法采用的数据的起始时间
% TMAXPRONY算法采用的数据的结束时间

MHC = [ 
1	300.0	1500
];



% 前侧节点名称
% 前侧节点基准电压(kV)
% 后侧节点名称
% 后侧节点基准电压(kV)
% 回路号 在 mpc.mode_id 中的索引
% 故障类型代码(必须为1)
% 故障侧编号(1:前侧2：后侧)
% 故障发生时间(周波)
% 从故障发生到故障相前侧断开时间间隔周波数
% 从故障发生到故障相后侧断开时间间隔周波数
% 故障点距离前侧节点百分比
% 接地电阻(标幺值)
% 接地电抗(标幺值)

FLT = [ 
1	3	51     	1 	1	50.00	4.500	5.000	0.0	0.0000	0.0000
];


%% bus names
mpc.bus_name = {
	'B01     	525.0',1;
	'B02     	525.0',2;
	'B03     	525.0',3;
	'B04     	525.0',4;
	'B05     	525.0',5;
	'B06     	525.0',6;
	'B07     	525.0',7;
	'B08     	525.0',8;
	'B09     	525.0',9;
	'B10     	525.0',10;
	'B11     	525.0',11;
	'B12     	525.0',12;
	'B13     	525.0',13;
	'B14     	525.0',14;
	'B15     	525.0',15;
	'B16     	525.0',16;
	'B17     	525.0',17;
	'B18     	525.0',18;
	'B19     	525.0',19;
	'B21     	525.0',20;
	'B22     	230.0',21;
	'B23     	230.0',22;
	'B24     	230.0',23;
	'B25     	230.0',24;
	'B26     	230.0',25;
	'B27     	230.0',26;
	'B28     	38.50',27;
	'B29     	38.50',28;
	'B30     	38.50',29;
	'B31     	38.50',30;
	'B32     	38.50',31;
	'B33     	38.50',32;
	'B34     	230.0',33;
	'B35     	37.00',34;
	'B36     	230.0',35;
	'B37     	37.00',36;
	'B38     	230.0',37;
	'B39     	37.00',38;
	'B40     	230.0',39;
	'B41     	37.00',40;
	'B42     	230.0',41;
	'B43     	37.00',42;
	'B44     	230.0',43;
	'B45     	37.00',44;
	'B46     	230.0',45;
	'B47     	37.00',46;
	'B48     	230.0',47;
	'B49     	37.00',48;
	'B50     	230.0',49;
	'B51     	37.00',50;
	'B52     	230.0',51;
	'B53     	37.00',52;
	'B54     	230.0',53;
	'B55     	37.00',54;
	'B56     	230.0',55;
	'B57     	37.00',56;
	'DN-01   	210.0',57;
	'DN-02   	199.0',58;
	'DP-01   	210.0',59;
	'DP-02   	199.0',60;
	'PV18-01 	0.400',61;
	'PV18-02 	0.400',62;
	'PV18-03 	0.400',63;
	'SC05-01 	20.00',64;
	'SC05-02 	20.00',65;
	'T3-01   	1.000',66;
	'T3-02   	1.000',67;
	'T3-03   	1.000',68;
	'T3-04   	1.000',69;
	'T3-05   	1.000',70;
	'T3-06   	1.000',71;
	'T3-07   	1.000',72;
	'T3-08   	1.000',73;
	'T3-09   	1.000',74;
	'T3-10   	1.000',75;
	'T3-11   	1.000',76;
	'T3-12   	1.000',77;
	'T3-13   	1.000',78;
	'T3-14   	1.000',79;
	'T3-15   	1.000',80;
	'TP14-01 	20.00',81;
	'TP15-01 	20.00',82;
	'TP16-01 	20.00',83;
	'TP17-01 	20.00',84;
	'WT01-01 	0.690',85;
	'WT01-02 	0.690',86;
	'WT01-03 	0.690',87;
	'WT19-01 	0.690',88;
	'WT19-02 	0.690',89;
	'WT19-03 	0.690',90;
};
%% bus zones
mpc.zonemap = {
	'0',2;
	'2R',3;
	'FH',1;
};
%% otherstring
mpc.other_string = {
	'A',1;
};
%% mode id
mpc.mode_id = {
	'1',1;
};
